/* 
* Програма 0. Використання зовнішніх переривань. INT0 переривання.
*
* Призначення програми: увімкнення LED0 світлодіоду
* при натасканні кнопки.
* 
* Кнопка приєднана до виводу PD2 порту D.
* Використовується внутрішній підтягуючий резистор.
* LED0 світлодіод приєднаний до 5-го піну порту B.
* 
* Запис 1 в PINB5 біт регістру PINB
* змінює мначення відповідного піну 
* на протилежне. При цьому даний пін
* повинен бути налаштований для генерації
* сигналу DDRB = (1<<PB5).
*
* Переривання INT0 виникає на виводі PD2 порту D.
* Особливістю INT0 переривання є можливість вибору
* конкретної причини винекнення переривання: наростаючий фронт,
* спадний фронт, будь-якй змінй стану виводу та 
* постійний низмкий рівень напруги на виводі.
* 
* В дані програмі переривання INT0 виникає за 
* будь-якої зміни виводу PD2.
* 
* Для використання INT0 переривання потрібно налаштувати
* регістри EIMSK, EICRA та SREG (регістр стану). 
* 1. Встановлюємо в регістрі EIMSK біт INT0 для активації 
*    INT0 переривання:
*    EIMSK |= (1<<INT0).
* 2. Встановлюємо в регістрі EICRA біт ISC00 для активації
*    режиму винекнення переривання INT0 за
*    будь-якої зміни виводу PD2:
*    EICRA |= (1<<ISC00).
* 3. Активуємо можливість обробки мікроконтролером 
*    всіх переривань, записом в регістр SREG біту I.
*    для цього використовуємо функцію sei().
*/

#include <avr/io.h>
#include <util/delay.h>
#include <avr/interrupt.h>

/* Спеціальна функція обробки переривань. 
ISR(INT0_vect)                                         /* Аргумент INT0_vect функції вказує вектор
{                                                      /* програми обробки переривання INT0.                                                  
    PINB |= (1<<PINB5);                                /* Перемикання світлодіоду LED0.
}
*/
int main000(void)
{
	/* Налаштування виводів */
	PORTB = 0x000;   
	PORTD = (1<<PD2);                                  /* Активація внутрішнього підтягуючого
	                                                      резистору на виводі PD2. */                                   
    DDRB = (1<<DDB5);                                  /* 5-й вивід працюють на вихід. */
    DDRD = (0<<DDD2);                                  /* 2-й пін працює на вхід. */
	
	/* Налаштування INT0 переривання */
	EICRA |= (1<<ISC00);                               /* Переривання виникає при зміні стану
	                                                      виводу PD2. */
	EIMSK |= (1<<INT0);                                /* Активація INT0. */
	sei();                                             /* Глобальна активація переривань. */
 
    while (1) 
    {
    }
	
    return 0;
}

