/* 
* Програма 3. Використання зовнішніх переривань. INT0 переривання.
*
* Призначення програми: LED0 світлодіод мигає постійно. 
* При натисканні на кнопку вмиається LED1 світлодіод. 
* При відпусканні кнопки LED1 світодіод вимикається.
* 
* Кнопка приєднана до виводу PD2 порту D.
* Використовується внутрішній підтягуючий резистор.
* LED0 світлодіод приєднаний до 5-го піну порту B.
* LED1 світлодіод приєднаний до 7-го піну порту B.
*
* Переривання INT0 виникає на виводі PD2 порту D.
* 
* В дані програмі переривання INT0 виникає за 
* будь-якої зміни виводу PD2.
* 
*/

#include <avr/io.h>
#include <util/delay.h>
#include <avr/interrupt.h>

/* Спеціальна функція обробки переривань. 
ISR(INT0_vect)                                         /* Аргумент INT0_vect функції вказує вектор 
{                                                      /* програми обробки переривання INT0.                                     
    PINB |= (1<<PINB7);                                /* Перемикання світлодіоду LED1.  
}
*/
int main003(void)
{
	/* Налаштування виводів */
	PORTB = 0x00;      
	PORTD = (1<<PD2);                                  /* Активація внутрішнього підтягуючого
	                                                      резистору на виводі PD2. */                                
    DDRB = ((1<<DDB5)|(1<<DDB7));                      /* 5-й та 7-й виводи працюють на вихід. */
    DDRD = (0<<DDD2);                                  /* 2-й пін працює на вхід. */

	/* Налаштування INT0 переривання */
	EICRA |= (1<<ISC00);                               /* Переривання виникає при зміні стану
	                                                      виводу PD2. */
	EIMSK |= (1<<INT0);                                /* Активація INT0. */
	sei();                                             /* Глобальна активація переривань. */
 
    while (1) 
    {
        PINB |= (1<<PINB5);                            /* Перемикання світлодіоду LED0. */
		_delay_ms(200);
    }
	
    return 0;
}

