/* 
* Програма 10. Лічильник від 0 до 99.
*
* Призначення програми: мигання світлодіоду LED0
* використовуючи таймер. 
* 
* LED0 світлодіод приєднаний до PB0 порту B.
*
* В даному проекті таймер використовується 
* для створення затримки.
* Таймер 1 - 16 бітний, - лічить від 0 до 65535.
* Поточне значення лічильника зберігається в
* регістрі TCNT1. 
* В CTC режимі лічильник збільшує значення TCNT1. 
* Потрібна кількість тактів лічильника зберікається
* в регісті OCR1A.
* Коли значення регістру TCNT1 стане рівним 
* значенню регісту OCF1A, в регістрі TIFR1
* встановлюється OCF1A біт, що викличе апаратне 
* переривання TIMER1_COMPA. Регістр лічильлника
* TCNT1 обнулиться і флаг OCF1A очиститься автоматично.
* При цьому процесор * викличе функцію обробки 
* переривань ISR. Дана функція перемикає сітлодіод.
*
* Кількість тактів таймеру для створення 
* потрібної затримки між миганнями LED0:
*
* tdel    = 0,2с.
* fclk_io = 1МГц.
* N       = 64.
* f0      = 1МГц/64        = 15625Гц.
* t0      = 1/15625Гц      = 0,000064с.
* n       = 0,2с/0,000064с = 3125
*
*/

#include <avr/io.h>
#include <avr/interrupt.h>
#define F_CPU              1000000UL                   /* Тактова частота процесора. */
#define LED0               PB0
#define SET_LED            (1<<LED0)
#define CLEAR_TIMER        TCNT1 = 0x00                /* Очистка регістру поточного значення 
	                                                      лічильника. */
static uint8_t n = 0;

ISR(TIMER1_COMPA_vect)
{
	if(n < 100)
	{
	    PORTD = ((n/10)<<4)|(n%10);
		n++;
	}
	else
	{
		PINB = SET_LED;                                    /* Перемикання світлодіоду */
		n = 0;
	}
}

int main(void)
{	
	/* Налаштування виводів */     
	PORTB = 0x00;
	PORTD = 0x00;
	DDRB = SET_LED;  
	DDRD = 0xFF;            
	                           
    /* Налаштування тамеру 1 */
    CLEAR_TIMER;                                      
	TCCR1A = 0x00;                                     
	OCR1A = 3125;                                      /* Кількість тактів лічильника. */
	TIMSK1 = (1<<OCIE1A);                              /* Активація TIMER1_COMPA переривання. */
	sei();                                             /* Глобальна активація переривань. */
	TCCR1B = (1<<WGM12)|(1<<CS11)|(1<<CS10);           /* Вибір внутрішнього джерела тактових 
	                                                      сигналів: fclk_io = F_CPU = 1МГц.
	                                                      Подільник частоти N = 64. 
														  Режим CTC.
														  Запуск лічильника.*/

    while (1) 
    {
    }
	
    return 0;
}

