/* 
* Програма 7. Використання переривань таймера.
*
* Призначення програми: мигання світлодіоду LED0
* використовуючи таймер. 
* 
* LED0 світлодіод приєднаний до PB0 порту B.
*
* В даному проекті таймер використовується 
* для створення затримки.
* Таймер 1 - 16 бітний, - лічить від 0 до 65535.
* Поточне значення лічильника зберігається в
* регістрі TCNT1. 
* В нормальному режимі лічильник збільшує 
* значення TCNT1. 
* Потрібна кількість тактів лічильника зберікається
* в регісті OCR1A.
* Коли значення регістру TCNT1 стане рівним 
* значенню регісту OCF1A, в регістрі TIFR1
* встановлюється OCF1A біт, що викличе апаратне 
* переривання TIMER1_COMPA. При цьому процесор
* викличе функцію обробки переривань ISR.
* Дана функція перемикає сітлодіод та
* обнуляє регістр TCNT1.
*
* Кількість тактів таймеру для створення 
* потрібної затримки між миганнями LED0:
*
* tdel    = 0.4с.
* fclk_io = 1МГц.
* N       = 64.
* f0      = 1МГц/64        = 15625Гц.
* t0      = 1/15625Гц      = 0,000064с.
* n       = 0.4с/0,000064с = 6250
*
*/

#include <avr/io.h>
#include <avr/interrupt.h>
#define F_CPU              1000000UL                   /* Тактова частота процесора. */
#define LED0               PB0
#define SET_LED            (1<<LED0)
#define CLEAR_TIMER        TCNT1 = 0x00                /* Очистка регістру поточного значення 
	                                                      лічильника. */
/*
ISR(TIMER1_COMPA_vect)
{
	PINB = SET_LED;                                    /* Перемикання світлодіоду 
	CLEAR_TIMER;
}
*/
int main007(void)
{	
	/* Налаштування виводів */     
	PORTB = 0x00;
	DDRB = SET_LED;              
	                           
    /* Налаштування тамеру 1 */
    CLEAR_TIMER;                                      
	TCCR1A = 0x00;                                     /* Нормальний режим роботи. */
	OCR1A = 6250;                                      /* Кількість тактів лічильника. */
	TIMSK1 = (1<<OCIE1A);                              /* Активація TIMER1_COMPA переривання. */
	sei();                                             /* Глобальна активація переривань. */
	TCCR1B = (1<<CS11)|(1<<CS10);                      /* Вибір внутрішнього джерела тактових 
	                                                      сигналів: fclk_io = F_CPU = 1МГц.
	                                                      Подільник частоти N = 64. 
														  Запуск лічильника.*/

    while (1) 
    {
    }
	
    return 0;
}

