/* 
* Програма 5. Таймер 1. 
*
* Призначення програми: мигання світлодіоду LED0
* використовуючи таймер. 
* 
* LED0 світлодіод приєднаний до PB0 порту B.
*
* В даному проекті таймер використовується 
* для створення затримки.
* Таймер 1 - 16 біт, - лічить від 0 до 65535.
* Поточне значення лічильника зберігається в
* регістрі TCNT1. 
* В нормальному режимі лічильник збільшує 
* значення TCNT1. Програма контролює це значення.
* Коли значення регістру TCNT1 стане рівним або більшим
* за значення, яке зберігається в змінній n, 
* регістр TCNT1 обнуляється і одночасно
* перемикається світлодіод. 
*
* Кількість тактів таймеру для створення 
* потрібної затримки між миганнями LED0:
* 
* Затримка між переключенням               tdel.
* Тактова частота периферійних модулів     fclk_io.
* Подільник частоти                        N.
* Тактова частота таймера                  f0 = fclk_io/N.
* Часова роздільна здатність таймера       t0 = 1/f0.
* Кількість тактів таймеру для досягнення 
* затримки tdel:                           n = tdel/t0.
*
* tdel    = 0.5с.
* fclk_io = 1МГц.
* N       = 64.
* f0      = 1МГц/64        = 15625Гц.
* t0      = 1/15625Гц      = 0,000064с.
* n       = 0.5с/0,000064с = 7812,5 = 7813
*
* 
*/

#include <avr/io.h>
#define F_CPU       1000000UL                          /* Тактова частота процесора. */
#define LED0        PB0
#define SET_LED     (1<<LED0)
#define CLEAR_TIMER TCNT1 = 0x00                       /* Очистка регістру поточного значення 
	                                                      лічильника. */
#define TOGGLE_LED  TCNT1 >= n                         /* Досягнуто n відліків таймера? */

int main005(void)
{
	const int n = 7813;
	
	/* Налаштування виводів */ 
	PORTB = 0x00;    
	DDRB = SET_LED;              
	                           
    /* Налаштування тамеру 1 */
    CLEAR_TIMER;                                      
	TCCR1A = 0x00;                                     /* Нормальний режим роботи. */
	TCCR1B = (1<<CS11)|(1<<CS10);                      /* Вибір внутрішнього джерела тактових 
	                                                      сигналів: fclk_io = F_CPU = 1МГц.
	                                                      Подільник частоти N = 64. 
														  Запуск лічильника. */
 
    while (1) 
    {
        if(TOGGLE_LED)                                 
		{
		    PINB = SET_LED;                            /* Перемикання світлодіоду */
		    CLEAR_TIMER;
		}
    }
	
    return 0;
}

