/* 
* Програма 2. Використання зовнішніх переривань. 
* PCI0 переривання, яке виникає при зміні стану будь-якого 
* виводу порту B.
*
* Призначення програми: увімкнення LED0 і вимкнення LED1 світлодіодів
* при натасканні кнопки.
* 
* Кнопка приєднана до виводу PB1 порту B.
* Використовується внутрішній підтягуючий резистор.
* LED0 світлодіод приєднаний до виводу PB5 порту B.
* LED1 світлодіод приєднаний до виводу PB7 порту B.
*
*/

#include <avr/io.h>
#include <util/delay.h>
#include <avr/interrupt.h>

/* Спеціальна функція обробки переривань. 
ISR(PCINT0_vect)                                       /* Аргумент PCINT0_vect функції вказує вектор 
{                                                      /* програми обробки переривання PCI0.                                                  
    PINB |= (1<<PINB5);                                /* Перемикання світлодіоду LED0. 
	PINB |= (1<<PINB7);                                /* Перемикання світлодіоду LED1. 
}
*/
int main002(void)
{
	/* Налаштування виводів */
	PORTB = (1<<PB7)|(1<<PB1);                         /* Вимкнути світлодіод LED0 та 
                                                          увімкнути світлодіод LED1. 
                                                          Активація внутрішнього підтягуючого
	                                                      резистору на виводі PB1. */                         
    DDRB = (0<<DDB1)|(1<<DDB5)|(1<<DDB7);              

	/* Налаштування PCI0 переривання */
	PCMSK0 = (1<<PB1);                                 /* Переривання виникає при зміні стану
	                                                      виводу PB1. */
	PCICR = (1<<PCIE0);                                /* Активація PCI0 переривання. */
	sei();                                             /* Глобальна активація переривань. */
 
    while (1) 
    {
    }
	
    return 0;
}

