/* 
* Програма 6. Використання вихідного регістру порівняння
* для встановлення затримки.
*
* Призначення програми: мигання світлодіоду LED0
* використовуючи таймер. 
* 
* LED0 світлодіод приєднаний до PB0 порту B.
*
* В даному проекті таймер використовується 
* для створення затримки.
* Таймер 1 - 16 бітний, - лічить від 0 до 65535.
* Поточне значення лічильника зберігається в
* регістрі TCNT1. 
* В нормальному режимі лічильник збільшує 
* значення TCNT1. 
* Потрібна кількість тактів лічильника зберікається
* в регісті OCR1A.
* Коли значення регістру TCNT1 стане рівним 
* значенню регісту OCF1A, в регістрі TIFR1
* встановлюється OCF1A біт. Програма перемикає
* сітлодіод, обнуляє регістр TCNT1 і OCF1A біт
* регістру TIFR1. 
*
* Кількість тактів таймеру для створення 
* потрібної затримки між миганнями LED0:
*
* tdel    = 0.2с.
* fclk_io = 1МГц.
* N       = 64.
* f0      = 1МГц/64        = 15625Гц.
* t0      = 1/15625Гц      = 0,000064с.
* n       = 0.2с/0,000064с = 3125
*
*/

#include <avr/io.h>
#define F_CPU              1000000UL                   /* Тактова частота процесора. */
#define LED0               PB0
#define SET_LED            (1<<LED0)
#define CLEAR_TIMER        TCNT1 = 0x00                /* Очистка регістру поточного значення 
	                                                      лічильника. */
#define CLEAR_COMPARE_FLAG TIFR1 = (1<<OCF1A)
#define TOGGLE_LED         (TIFR1 & (1<<OCF1A))        /* Досягнуто n відліків таймера? */

int main006(void)
{	
	/* Налаштування виводів */     
	PORTB = 0x00;
	DDRB = SET_LED;              
	                           
    /* Налаштування тамеру 1 */
    CLEAR_TIMER;                                      
	TCCR1A = 0x00;                                     /* Нормальний режим роботи. */
	OCR1A = 3125;                                      /* Кількість тактів лічильника. */
	TCCR1B = (1<<CS11)|(1<<CS10);                      /* Вибір внутрішнього джерела тактових 
	                                                      сигналів: fclk_io = F_CPU = 1МГц.
	                                                      Подільник частоти N = 64. 
														  Запуск лічильника. */
 
    while (1) 
    {
        if(TOGGLE_LED)                                 
		{
		    PINB = SET_LED;                            /* Перемикання світлодіоду */
			CLEAR_COMPARE_FLAG;
		    CLEAR_TIMER;
		}
    }
	
    return 0;
}

