/* 
* Програма 1. Використання зовнішніх переривань. INT0 переривання.
*
* Призначення програми: увімкнення LED0 і вимкнення LED1 світлодіодів
* при натасканні кнопки.
* 
* Кнопка приєднана до виводу PD2 порту D.
* Використовується внутрішній підтягуючий резистор.
* LED0 світлодіод приєднаний до 5-го піну порту B.
* LED1 світлодіод приєднаний до 3-го піну порту С.
*
*/

#include <avr/io.h>
#include <util/delay.h>
#include <avr/interrupt.h>

/* Спеціальна функція обробки переривань. 
ISR(INT0_vect)                                         /* Аргумент INT0_vect функції вказує вектор 
{                                                      /* програми обробки переривання INT0.                                                   
    PINB |= (1<<PINB5);                                /* Перемикання світлодіоду LED0. 
	PINC |= (1<<PINC3);                                /* Перемикання світлодіоду LED1. 
}
*/
int main001(void)
{
	/* Налаштування виводів */
	PORTB = 0x00;                                      /* Вимкнути світлодіод LED0. */
	PORTC = (1<<PC3);                                  /* Увімкнути світлодіод LED1. */
	PORTD = (1<<PD2);                                  /* Активація внутрішнього підтягуючого
	                                                      резистору на виводі PD2. */                         
    DDRB = (1<<DDB5);                                  /* 5-й вивід порту B працює на вихід. */
	DDRC = (1<<DDC3);                                  /* 3-й вивід порту C працює на вихід. */
    DDRD = (0<<DDD2);                                  /* 2-й вивід порту D працює на вхід. */

	/* Налаштування INT0 переривання */
	EICRA |= (1<<ISC00);                               /* Переривання виникає при зміні стану
	                                                      виводу PD2. */
	EIMSK |= (1<<INT0);                                /* Активація INT0. */
	sei();                                             /* Глобальна активація переривань. */
 
    while (1) 
    {
    }
	
    return 0;
}

