/* 
* Програма 7. Оптимізація коду.
* 
* Зовнішні переривання - це переривання, 
* що виникають при зміні стану певних виводів мікроконтролеру.
*
* Призначення програми: LED0 світлодіод мигає постійно. 
* Після натискання на кнопку вмиається LED1 світлодіод, 
* а LED0 світлодіод вимикається. 
* При відпусканні кнопки LED1 світодіод вимикається, 
* а LED0 - починає мигати.
* 
* Кнопка приєднана до виводу PD2 порту D.
* Використовується внутрішній підтягуючий резистор.
* LED0 світлодіод приєднаний до 5-го піну порту B.
* LED1 світлодіод приєднаний до 7-го піну порту B.
* 
* Запис 1 в PINB7 біт регістру PINB
* змінює мначення відповідного піну 
* на протилежне. При цьому даний пін
* повинен бути налаштований для генерації
* сигналу DDRB = (1<<PB7).
*
* Переривання INT0 виникає на виводі PD2 порту D.
* Особливістю INT0 переривання є можливість вибору
* конкретної причини винекнення переривання: наростаючий фронт,
* спадний фронт, будь-якй змінй стану виводу та 
* постійний низмкий рівень напруги на виводі.
* 
* В дані програмі переривання INT0 виникає за 
* будь-якої зміни виводу PD2.
* 
* Для використання INT0 переривання потрібно налаштувати
* регістри EIMSK, EICRA та SREG (регістр стану). 
* 1. Встановлюємо в регістрі EIMSK біт INT0 для активації 
*    INT0 переривання:
*    EIMSK |= (1<<INT0).
* 2. Встановлюємо в регістрі EICRA біт ISC00 для активації
*    режиму винекнення переривання INT0 за
*    будь-якої зміни виводу PD2:
*    EICRA |= (1<<ISC00).
* 3. Активуємо можливість обробки мікроконтролером 
*    всіх переривань, записом в регістр SREG біту I.
*    для цього використовуємо функцію sei().
*/

#include <avr/io.h>
#include <util/delay.h>
#include <avr/interrupt.h>

#define LED0 (1<<PB5)
#define LED1 (1<<PB7)
#define ON   1
#define OFF  0

uint8_t led0_state = ON;

/* Спеціальна функція обробки переривань. */
/*
ISR(INT0_vect)                                         /* Аргумент INT0_vect функції вказує вектор 
{                                                      /* програми обробки переривання INT0. 
	if(led0_state)
	{
		led0_state = OFF;
		PORTB &= ~LED0;
		PORTB |= LED1;
	}
	else
	{
		led0_state = ON;
		PORTB &= ~LED1;
	}
}
*/
int main03(void)
{
	/* Налаштування виводів */
	PORTB = 0x00;                                      
    DDRB = (LED0|LED1);                                /* 5-й та 7-й виводи працюють на вихід. */
    DDRD = (0<<PD2);                                   /* 2-й пін працює на вхід. */
	PORTD = (1<<PD2);                                  /* Активація внутрішнього підтягуючого
	                                                      резистору на виводі PD2. */

	/* Налаштування INT0 переривання */
	EIMSK |= (1<<INT0);                                /* Активація INT0. */
	EICRA |= (1<<ISC00);                               /* Переривання виникає при зміні стану
	                                                      виводу PD2. */
	sei();                                             /* Глобальна активація переривань. */
 
    while (1) 
    {
		if(led0_state)
		{
		    PORTB ^= LED0;		    	
		}
		else
		{
			PORTB &= ~LED0;
		}
		_delay_ms(500);					
    }
	
    return 0;
}

