/* 
* Програма 6. Перемикання світлодіоду за рахунок встановлення PINB5 регістру PINB.
* 
* Призначення програми: при натисканні кнопки вимикається світлодіод.
* 
* Кнопка приєднана до 2-го вивода порту B.
* Використовується внутрішній підтягуючий резистор.
* Світлодіод приєднаний до 5-го виводу порту B.
* 
* На початку роботи програми світлодіод увімкнений.
* 2-й пін порту B потрібно запрограмувати на зчитування сигналу.
* 5-й пін порту B потрібно запрограмувати на генерацію сигналу.
* 
* Програма постійно опитує 2-й пін порту B. 
* Коли кнопка не натиснута на вході буде 1.
* Якщо кнопка натиснута, то на вході буде 0.
* 
* Коли на вході 2-го піну порту B буде 0, 
* то на вихід 5-го піну порту B потрібно подати 0 для вимикання світлодіоду.
*/
#include <avr/io.h>

#define SET_LED           (1<<PB5)                     /* Увімкнути світлодіод */
#define TURN_LED          PINB = (1<<PINB5)            /* Перемкнути cвітлодіод. */
#define PULLUP_ON         (1<<PB2)                     /* Активація внутрішнього 
                                                          підтягуючого резистора. */

#define SET_PORTB         PORTB |= SET_LED | PULLUP_ON /* Увімкнути cвітлодіод та активувати
                                                          внутрішній підтягуючий резистор. */
#define DDR_BUTTPN_LED    DDRB = SET_LED               /* 2-й пін працює на вхід, 
                                                          5-й пін працює на вихід. */
 
#define BUTTON_RELEASED   (PINB & (1<<PINB2))          /* Кнопка відпущена? */
#define BUTTON_PRESSED    (PINB & (1<<PINB2))==0       /* Кнопка натиснута? */

int main(void)
{
	DDR_BUTTPN_LED; 
    SET_PORTB;                                              

    while (1) 
    {
        /* Перевірка стану 2-го піна */
        while (BUTTON_RELEASED)                        /* Цикл виконується доки кнопка не натиснута */
        {                                                      
        }
		
		TURN_LED;
		
        while (BUTTON_PRESSED)                         /* Цикл виконується доки кнопка натиснута */
        {                                   
        }
		
		TURN_LED;		
    }
    return 0;
}

