/* 
* Програма 1. Вимкнення світлодіоду.
* 
* Призначення програми: при натисканні кнопки вимикається світлодіод.
* 
* Кнопка приєднана до 2-го вивода порту B.
* Використовується зовнішній підтягуючий резистор. 
* Світлодіод приєднаний до 5-го виводу порту B 
* 
* На початку роботи програми світлодіод увімкнений.
* 2-й пін порту B потрібно запрограмувати на зчитування сигналу.
* 5-й пін порту B потрібно запрограмувати на генерацію сигналу.
* 
* Програма постійно опитує 2-й пін порту B. 
* Коли кнопка не натиснута на вході буде 1.
* Якщо кнопка натиснута, то на вході буде 0.
* 
* Коли на вході 2-го піну порту B буде 0, 
* то на вихід 5-го піну порту B потрібно подати 0 для вимикання світлодіоду.
*/
#include <avr/io.h>

int main1(void)
{
    PORTB = (1<<PB5);                     /* Увімкнути cвітлодіод */
    DDRB = (1<<DDB5);                     /* 2-й пін працює на вхід */
                                          /* 5-й пін працює на вихід */

    while (1) 
    {
        /* Перевірка стану 2-го піна */
        if (PINB & (1<<PINB2))            /* Якщо на вході 2-го піну 1 - */
        {                                 /* кнопка не натиснута. */
            PORTB |= (1<<PB5);            /* Увімкнути cвітлодіод */
        }
        else                              /* На вході 2-го піну 0 - */
        {                                 /* кнопка натиснута. */
            PORTB &= ~(1<<PB5);           /* Вимкнути світлодіод */
        }
    }
    return 0;
}

