/* 
* Програма 2. Використання макросів.
*
* Призначення програми: при натисканні кнопки вимикається світлодіод.
* 
* Кнопка приєднана до 2-го вивода порту B.
* Використовується зовнішній підтягуючий резистор. 
* Світлодіод приєднаний до 5-го виводу порту B 
*
* На початку роботи програми світлодіод увімкнений.
* 2-й пін порту B потрібно запрограмувати на зчитування сигналу.
* 5-й пін порту B потрібно запрограмувати на генерацію сигналу.
* 
* Програма постійно опитує 2-й пін порту B. 
* Коли кнопка не натиснута на вході буде 1.
* Якщо кнопка натиснута, то на вході буде 0.
* 
* Коли на вході 2-го піну порту B буде 0, 
* то на вихід 5-го піну порту B потрібно подати 0 для вимикання світлодіоду.
*/
#include <avr/io.h>

#define LED_0N            (1<<PB5)          /* Увімкнути cвітлодіод. */
#define LED_OFF           ~(1<<PB5)         /* Вимкнути світлодіод. */
#define DDR_BUTTPN_LED    (1<<DDB5)         /* 2-й пін працює на вхід, */
                                            /* 5-й пін працює на вихід. */

#define BUTTON_PRESSED    PINB & (1<<PINB2) /* Кнопка натиснута? 
                                               Повертає 1, якщо кнопка не натиснута.
											   Повертає 0, якщо кнопка натиснута. */

int main2(void)
{
    PORTB = LED_0N;                         /* Увімкнути cвітлодіод. */
    DDRB = DDR_BUTTPN_LED;                  

    while (1) 
    {
        /* Перевірка стану 2-го піна */
        if (BUTTON_PRESSED)                 /* Кнопка натиснута? */
        {                                   /* Ні! */
            PORTB |= LED_0N;                /* Увімкнути cвітлодіод. */
        }
        else                                /* Так! */
        {                                   
            PORTB &= LED_OFF;               /* Вимкнути світлодіод. */
        }
    }
    return 0;
}

