/*
* Програма 0. Робота з АЦП.
*
* Призначення програми: одноразове перетворення, 
* при запуску програми, напруги в двійковий код 
* і вивід його на матрицю світлодіодів.
*
* Обладнання:
* - мікроконтролер ATmega168
* - джерело живлення та опорної напруги для АЦП;
* - джерело постійної напруги, яке буде виміряне vsource;
* - 10 світлодіодів та резисторів.
*
* Джерело опорного живлення приєднано до виводу AVCC.
* Вхідний аналоговий канал АЦП: ADC0. До цього каналу приєднане
* джерело постійної напруги.
* 8 світлодіодів та резисторів приєднані до виводів порту B, 
* 2 світлодіоди та резистори приєднані до PD0 та PD1 порту D.
* 
* АЦП - 10 розрядний, тому для зберігання 10 розрядів
* двійкового коду потрібна 16 розрядна змінна: 
* uint16_t adc_value. 
* Для подальшого виводу значення adc_value на світлодіоди:
* 8 молодших бітів записуються в регістр PORTB.
* 2 старші розряди записуються в PD0 та PD1 регістру PORTD. 
*
*/

#include <avr/io.h>


int main00(void)
{
    /* Ініціалізація АЦП */
	ADMUX |= (1<<REFS0);                               /* Опорна напруга на AVCC, ADC0 вхідний аналоговий
	                                                      канал АЦП. */
	ADCSRA |= (1<<ADPS1)|(1<<ADPS0);                   /* Подільник тактової частоти, N=8. */
	ADCSRA |= (1<<ADEN);                               /* Активація АЦП. */
	
	/* Ініціалізація вихідних 10 виводів. */
	PORTB = 0x00;
	PORTD = 0x00;
	DDRB = 0xFF;                                       /* Виводяться 8 молодших розрядів значення АЦП. */
	DDRD = 0x03;                                       /* Виводяться 2 старших розряди значення АЦП. */
	
	uint16_t adc_value = 0;                            /* Зберігає двійковий код АДЦ перетворення. */
	
	ADCSRA |= (1<<ADSC);                               /* Запуск перетворення аналогового сигналу в код. */
	while((ADCSRA & (1<<ADSC))>0);                     /* Чекаємо завершення перетворення. */
	adc_value = ADC;                                   /* Результат перетворення зберігається в 
	                                                      16 розрядному регістрі ADC. */
	PORTB = adc_value;                                 /* Вивід 8 молодших розрядів. */
	PORTD = (adc_value>>8);                            /* Вивід 2 старших розрядів. */
	
    while (1) 
    {
    }
}

