/*
* Програма 5. Робота з SPI інтерфейсом в режимі Slave.
*
* Призначення програми: відображення байту переданого
* по інтерфейсу SPI за допомогою світлодіодів.
*
* Даний вихідний код завантажується в керований контролер.
*
* Обладнання:
* - мікроконтролер ATmega168;
* - вісім світлодіодів та резисторів.
*
* З'єднання виводів мікроконтролеру:
* Виводи для відображення інформації:
* - виводи PD0-PD7 порту D - приєднані до восьми 
*   світлодіодів;
* Приймання інформації по шині SPI:
*   Slave     Master
* - MOSI   :  MOSI;
* - MISO   :  MISO;
* - SCK    :  SCK ;
* - SS     :  SS  ;
*
*/

#define F_CPU              1000000UL                   /* Тактова частота процесора. */
#include <avr/io.h>
#include <util/delay.h>

#define MISO               PB4                         /* Вивід для передачі байту інформації до
                                                          Master контролеру. */

/* Ініціалізація виводів мікроконтролеру ATmega168. */
void port_init(void)
{
    /* Входи для передачі байту на світлодіоди. */
	PORTD = 0x00;
	DDRD = 0xFF;
	
	/* Ініціалізація SPI інтерфейсу. */
    DDRB = (1<<MISO);                                  /* Встановлення виводів SPI шини:
                                                          - MOSI SCK SS - на вхід;
														  - MISO - на вихід. */
    SPCR = (1<<SPE);                                   /* SPE - Активація SPI шини. */	
	/* Очищення SPIF прапорця за рахунок зчитування 
	   SPSR та SPDR регістрів. */
	volatile uint8_t tempByte;
	tempByte = SPSR;
	tempByte = SPDR;
}

/* Прийом байту по шині SPI. */
uint8_t spi_receive_byte(void)
{
    while(!(SPSR & (1<<SPIF)));                        /* Чекаємо закінчення прийому байту. */
    return SPDR;                                       /* Повертаємо прийнятий байт. */
}

/* Відображення байту на світлодіодах. */
void display(uint8_t byte)
{
	PORTD = byte;
}

int main(void)
{
	port_init();
	
    while (1)
    {
        display(spi_receive_byte());
    }
}

