/*
* Програма 5. Робота з SPI інтерфейсом в режимі Master.
*
* Призначення програми: зчитування байту із Slave 
* контролеру по SPI шині та вивід його на світлодіоди. 
*
* Даний вихідний код завантажується в Master контролер.
*
* Обладнання:
* - мікроконтролер ATmega168;
* - вісім світлодіодів та резисторів.
*
* З'єднання виводів мікроконтролеру:
* Виводи відображення інформації:
* - виводи PD0-PD7 порту D - приєднані до восьми 
*   світлодіодів;
* Передавання та пиймання інформації по шині SPI:
*   Master    Slave
* - MOSI   :  MOSI;
* - MISO   :  MISO;
* - SCK    :  SCK ;
* - SS     :  SS  ;
*
* В даному коді зчитування байту із Slave контролеру
* відбувається в два етапи:
* 1) Master надсилає в Slave байт з будь-яким значенням, як
* сигналізація того щоб Slave завантажив у свій регістр даних
* байт стану логічних ключів LOGICTOGGLE.
* 2) Master надсилає в Slave другий раз байт з будь-яким значенням,
* при цьому паралельно в регістр даних записується
* байт стану логічних ключів LOGICTOGGLE із Slave.
*
* Прапорець SPIF в регістрі SPSR забирається:
* 1) зчитується регістр SPSR;
* 2) зчитується/записується значення регістра даних SPDR.
*
*/

#define F_CPU              1000000UL                   /* Тактова частота процесора. */
#include <avr/io.h>
#include <util/delay.h>

#define SS                 PB2                         /* Вивід дозволяє/забороняє передавання даних
                                                          по шині SPI:
														  - 1 - передавання даних заборонене;
														  - 0 - дозволяє передавання даних. */
#define MOSI               PB3                         /* Вивід для передачі байту інформації до
                                                          Slave контролеру по шині SPI. */
#define MISO               PB4                         /* Вивід для зчитування байту інформації від
                                                          Slave контролеру по шині SPI. */
#define SCK                PB5                         /* Вивід для передачі синхро-імпульсів для шині SPI. */
#define SPI_GET_DATA       0x00                        /* Команда передається в Slave контролер для
                                                          зчитування даних. */

/* Ініціалізація виводів мікроконтролеру ATmega168. */
void port_init(void)
{
    /* Входи для передачі байту на світлодіоди. */
	PORTD = 0x00;
	DDRD = 0xFF;
	
	/* Ініціалізація SPI інтерфейсу. */
    DDRB = (1<<MOSI)|(1<<SCK)|(1<<SS);                 /* Встановлення виводів SPI шини:
                                                          - MOSI SCK SS - на вихід;
														  - MISO - на вхід. */
    PORTB &= ~(1<<SS);                                 /* На вивід SS подається 0 - дані в Slave 
                                                          можна передавати. */                                     
    SPCR = (1<<SPE)|(1<<MSTR)|(1<<SPR0);               /* SPE - Активація SPI шини;
                                                          MSTR - контролер працює в режимі Master;
                                                          SPR0 - подільник частоти - 16. */
	/* Очищення SPIF прапорця за рахунок зчитування 
	   SPSR та SPDR регістрів. */
	volatile uint8_t tempByte;
	tempByte = SPSR;
	tempByte = SPDR;
}

/* Передача байту по шині SPI. */
void spi_transmit_byte(uint8_t byte)
{
    SPDR = byte;                                       /* Початок передачі байту. */
	while(!(SPSR & (1<<SPIF)));                        /* Чекаємо закінчення передачі. */
}

/* Прийом байту по шині SPI. */
uint8_t spi_receive_byte(void)
{
    spi_transmit_byte(SPI_GET_DATA);
	_delay_ms(10);
	spi_transmit_byte(SPI_GET_DATA);
    return SPDR;                                       /* Повертаємо прийнятий байт. */
}

/* Відображення байту на світлодіодах. */
void display(uint8_t byte)
{
	PORTD = byte;
}

int main(void)
{
	port_init();
	
    while (1)
    {
		display(spi_receive_byte());
		_delay_ms(100);
    }
}

