/*
* Програма 2. Розділення програми на модулі.
*
* Призначення програми: виводить строки на LCD.
*
* Обладнання:
* - мікроконтролер ATmega16;
* - LCD дисплей LM016L;
*
* LCD - рідкокристалічний символьний дисплей. 
* LM016L дисплей складається з модуля відображення та 
* контролера HD44780, який керує дисплеєм. Данні на 
* дисплей виводяться через контролер.
* Існує протокол обміну даними із контролером HD44780,
* який можна знайти в документації до нього.
* Виводи LM016L дисплею:
* - VSS   - "земля";
* - VDD   - живлення;
* - RS    - визначає тип передаваної інформації:
*           0 - команда;
*	        1 - дані;
* - RW    - Напрям передавання інформації:
*           0 - запис в контролер дисплею;
*	        1 - зчитування із контролеру;
* - E     - при зміні значення на даному виводі
*           від 1 до 0 починається процес
*		    запису/зчитування інформації;
* - D0-D7 - паралельна 8-біт шина обміну
*           даними з дисплеєм;
* За один цикл на дисплей можна передати один байт.
* Існує два режими передавання байту в контролер 
* дисплею:
* 1) передача байта за один цикл; при цьому 
*    використовуються всі вісім виводів D0-D7;
* 2) передача байта за два цикли; при цьому 
*    використовуються тільки чотири виводи D4-D7; 
*    інформація передається повільніше, але 
*    використовується менше виводів;
*    в даному режимі байт передається половинами
*    спочатку старші 4-ри біти потім молодші;
* Вибір режиму проводиться при ініціалізації дисплею.
*
* Виводи контролера ATmega168 при 4-біт режимі роботи LCD,
* приєднані до дисплею:
* PD2 - RS
* PD3 - E
* PD4 - D4
* PD5 - D5
* PD6 - D6
* PD7 - D7
*
* Виводи дисплею:
* VSS -	приєднаний до "землі" ;
* VDD - до живлення;
* RW - до нульового потенціалу - запис в контролер дисплею.
*
*/

#include "lcd.h" 

 /* Ініціалізація виводів мікроконтролеру ATmega168. */
void port_init(void)
{
	PORTD = 0x00;
	DDRD = 0xFF;
}

int main(void)
{
	port_init();
	lcd_init();
	set_position(0, 0);
	print_lcd("Hello World!");
	set_position(3, 1);
	print_lcd("Hello AVR!");
		
    while (1) 
    {
    }
}

