/*
 * Світлодіоди вмикаються послідовно по одному, по два, і т.д з повтореннями
 */ 

#include <avr/io.h>
#include <util/delay.h>


int main11(void)
{
    int delay = 500;
    int a = 0, b = 0;
	
	PORTB = 0x00;
	DDRB = 0xFF;
	
    while (1) 
    {
		for(int j = 0; j < 8; j++)
		{
			for(int i = 0; i < (8-j); i++)
			{
				// формула для отримання послідовного вімкнення свфтлодіодів
				// спачатку по одному, потім по два і т.д
				// 2^i*(2^(j+1)-1)
				// для отримання степені двійки використаємо зсув вліво
				// a = (1<<i);
				// b = (1<<(j+1));
				// PORTB = a*(b-1);
				PORTB = (1<<i)*((1<<(j+1))-1);
				_delay_ms(delay);
			}
		}
		
    }
}

